IDENTIFICATION DIVISION.
PROGRAM-ID. DEPTPAY.
AUTHOR. TDD EXAMPLE.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 DEPT-RECORD.
   05 DEPT-NAME               PIC X(20).
   05 DEPT-LOC                PIC X(12).
   05 DEPT-MANAGER.
      10 MANAGER-FNAME        PIC X(15).
      10 MANAGER-LNAME        PIC X(15).
   05 DEPT-NBR-EMPS           PIC 9(3).
   05 DEPT-TOTAL-SALARIES     PIC 9(7)V99.
   05 DEPT-AVG-SALARY         PIC 9(7)V99.

PROCEDURE DIVISION.
A000-MAIN-LOGIC.
    PERFORM B100-AVERAGE-SALARY.
    PERFORM B200-DISPLAY-DETAILS.
    STOP RUN.

B100-AVERAGE-SALARY.
    MOVE "FINANCE"            TO DEPT-NAME.
    MOVE "SOUTHWEST"          TO DEPT-LOC.
    MOVE "Millard"            TO MANAGER-FNAME.
    MOVE "Fillmore"           TO MANAGER-LNAME.
    MOVE 19                   TO DEPT-NBR-EMPS.
    MOVE 111111.11            TO DEPT-TOTAL-SALARIES.
    COMPUTE DEPT-AVG-SALARY =
        (DEPT-TOTAL-SALARIES / DEPT-NBR-EMPS).

B200-DISPLAY-DETAILS.
    DISPLAY "Nome do Departamento: " DEPT-NAME.
    DISPLAY "Local do Departamento: " DEPT-LOC.
    DISPLAY "Primeiro Nome do Gerente: " MANAGER-FNAME.
    DISPLAY "Ultimo Nome do Gerente: " MANAGER-LNAME.
    DISPLAY "Salario Medio do Dept: " DEPT-AVG-SALARY.
    DISPLAY "Numero de funcionarios: " DEPT-NBR-EMPS.
